SebastianOberschwendtner/OTOS/mocking/stm32/dma_stm32_fake.h
/**
 * OTOS - Open Tec Operating System
 * Copyright (c) 2021 Sebastian Oberschwendtner, sebastian.oberschwendtner@gmail.com
 *
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 *
 * @attention
 * All the peripheral type definition are taken from the peripheral library
 * files provided by ST.
 *
 * Copyright:
 * <h2><center>&copy; COPYRIGHT(c) 2017 STMicroelectronics</center></h2>
 */

#ifndef DMA_STM32_FAKE_H_
#define DMA_STM32_FAKE_H_

// *** Includes ***
#include "../base/fake.h"
#include <cstdint>

// *** Class defines for fake peripherals
/**
 * @brief DMA Controller
 */

class DMA_Stream_TypeDef : public Fake::Peripheral
{
public:
    // Methods for unit testing
    void registers_to_default(void) override;

    // Fake registers of DMA stream
    Fake::Register_t CR;   /*!< DMA stream x configuration register      */
    Fake::Register_t NDTR; /*!< DMA stream x number of data register     */
    Fake::Register_t PAR;  /*!< DMA stream x peripheral address register */
    Fake::Register_t M0AR; /*!< DMA stream x memory 0 address register   */
    Fake::Register_t M1AR; /*!< DMA stream x memory 1 address register   */
    Fake::Register_t FCR;  /*!< DMA stream x FIFO control register       */
};

class DMA_TypeDef : public Fake::Peripheral
{
public:
    // Methods for unit testing
    void registers_to_default(void) override;

    // Fake registers of DMA
    Fake::Register_t LISR;  /*!< DMA low interrupt status register,      Address offset: 0x00 */
    Fake::Register_t HISR;  /*!< DMA high interrupt status register,     Address offset: 0x04 */
    Fake::Register_t LIFCR; /*!< DMA low interrupt flag clear register,  Address offset: 0x08 */
    Fake::Register_t HIFCR; /*!< DMA high interrupt flag clear register, Address offset: 0x0C */
};

// *** Public references to fake peripherals
// Fake peripheral pointers
extern DMA_TypeDef *DMA1;
extern DMA_Stream_TypeDef *DMA1_Stream0;
extern DMA_Stream_TypeDef *DMA1_Stream1;
extern DMA_Stream_TypeDef *DMA1_Stream2;
extern DMA_Stream_TypeDef *DMA1_Stream3;
extern DMA_Stream_TypeDef *DMA1_Stream4;
extern DMA_Stream_TypeDef *DMA1_Stream5;
extern DMA_Stream_TypeDef *DMA1_Stream6;
extern DMA_Stream_TypeDef *DMA1_Stream7;
extern DMA_TypeDef *DMA2;
extern DMA_Stream_TypeDef *DMA2_Stream0;
extern DMA_Stream_TypeDef *DMA2_Stream1;
extern DMA_Stream_TypeDef *DMA2_Stream2;
extern DMA_Stream_TypeDef *DMA2_Stream3;
extern DMA_Stream_TypeDef *DMA2_Stream4;
extern DMA_Stream_TypeDef *DMA2_Stream5;
extern DMA_Stream_TypeDef *DMA2_Stream6;
extern DMA_Stream_TypeDef *DMA2_Stream7;

// Fake addresses
extern std::uintptr_t DMA1_BASE;
extern std::uintptr_t DMA1_Stream0_BASE;
extern std::uintptr_t DMA1_Stream1_BASE;
extern std::uintptr_t DMA1_Stream2_BASE;
extern std::uintptr_t DMA1_Stream3_BASE;
extern std::uintptr_t DMA1_Stream4_BASE;
extern std::uintptr_t DMA1_Stream5_BASE;
extern std::uintptr_t DMA1_Stream6_BASE;
extern std::uintptr_t DMA1_Stream7_BASE;
extern std::uintptr_t DMA2_BASE;
extern std::uintptr_t DMA2_Stream0_BASE;
extern std::uintptr_t DMA2_Stream1_BASE;
extern std::uintptr_t DMA2_Stream2_BASE;
extern std::uintptr_t DMA2_Stream3_BASE;
extern std::uintptr_t DMA2_Stream4_BASE;
extern std::uintptr_t DMA2_Stream5_BASE;
extern std::uintptr_t DMA2_Stream6_BASE;
extern std::uintptr_t DMA2_Stream7_BASE;

// === Bitmasks ===

/******************************************************************************/
/*                                                                            */
/*                             DMA Controller                                 */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DMA_SxCR register  *****************/
#define DMA_SxCR_CHSEL_Pos (25U)
#define DMA_SxCR_CHSEL_Msk (0x7UL << DMA_SxCR_CHSEL_Pos) /*!< 0x0E000000 */
#define DMA_SxCR_CHSEL DMA_SxCR_CHSEL_Msk
#define DMA_SxCR_CHSEL_0 0x02000000U
#define DMA_SxCR_CHSEL_1 0x04000000U
#define DMA_SxCR_CHSEL_2 0x08000000U
#define DMA_SxCR_MBURST_Pos (23U)
#define DMA_SxCR_MBURST_Msk (0x3UL << DMA_SxCR_MBURST_Pos) /*!< 0x01800000 */
#define DMA_SxCR_MBURST DMA_SxCR_MBURST_Msk
#define DMA_SxCR_MBURST_0 (0x1UL << DMA_SxCR_MBURST_Pos) /*!< 0x00800000 */
#define DMA_SxCR_MBURST_1 (0x2UL << DMA_SxCR_MBURST_Pos) /*!< 0x01000000 */
#define DMA_SxCR_PBURST_Pos (21U)
#define DMA_SxCR_PBURST_Msk (0x3UL << DMA_SxCR_PBURST_Pos) /*!< 0x00600000 */
#define DMA_SxCR_PBURST DMA_SxCR_PBURST_Msk
#define DMA_SxCR_PBURST_0 (0x1UL << DMA_SxCR_PBURST_Pos) /*!< 0x00200000 */
#define DMA_SxCR_PBURST_1 (0x2UL << DMA_SxCR_PBURST_Pos) /*!< 0x00400000 */
#define DMA_SxCR_CT_Pos (19U)
#define DMA_SxCR_CT_Msk (0x1UL << DMA_SxCR_CT_Pos) /*!< 0x00080000 */
#define DMA_SxCR_CT DMA_SxCR_CT_Msk
#define DMA_SxCR_DBM_Pos (18U)
#define DMA_SxCR_DBM_Msk (0x1UL << DMA_SxCR_DBM_Pos) /*!< 0x00040000 */
#define DMA_SxCR_DBM DMA_SxCR_DBM_Msk
#define DMA_SxCR_PL_Pos (16U)
#define DMA_SxCR_PL_Msk (0x3UL << DMA_SxCR_PL_Pos) /*!< 0x00030000 */
#define DMA_SxCR_PL DMA_SxCR_PL_Msk
#define DMA_SxCR_PL_0 (0x1UL << DMA_SxCR_PL_Pos) /*!< 0x00010000 */
#define DMA_SxCR_PL_1 (0x2UL << DMA_SxCR_PL_Pos) /*!< 0x00020000 */
#define DMA_SxCR_PINCOS_Pos (15U)
#define DMA_SxCR_PINCOS_Msk (0x1UL << DMA_SxCR_PINCOS_Pos) /*!< 0x00008000 */
#define DMA_SxCR_PINCOS DMA_SxCR_PINCOS_Msk
#define DMA_SxCR_MSIZE_Pos (13U)
#define DMA_SxCR_MSIZE_Msk (0x3UL << DMA_SxCR_MSIZE_Pos) /*!< 0x00006000 */
#define DMA_SxCR_MSIZE DMA_SxCR_MSIZE_Msk
#define DMA_SxCR_MSIZE_0 (0x1UL << DMA_SxCR_MSIZE_Pos) /*!< 0x00002000 */
#define DMA_SxCR_MSIZE_1 (0x2UL << DMA_SxCR_MSIZE_Pos) /*!< 0x00004000 */
#define DMA_SxCR_PSIZE_Pos (11U)
#define DMA_SxCR_PSIZE_Msk (0x3UL << DMA_SxCR_PSIZE_Pos) /*!< 0x00001800 */
#define DMA_SxCR_PSIZE DMA_SxCR_PSIZE_Msk
#define DMA_SxCR_PSIZE_0 (0x1UL << DMA_SxCR_PSIZE_Pos) /*!< 0x00000800 */
#define DMA_SxCR_PSIZE_1 (0x2UL << DMA_SxCR_PSIZE_Pos) /*!< 0x00001000 */
#define DMA_SxCR_MINC_Pos (10U)
#define DMA_SxCR_MINC_Msk (0x1UL << DMA_SxCR_MINC_Pos) /*!< 0x00000400 */
#define DMA_SxCR_MINC DMA_SxCR_MINC_Msk
#define DMA_SxCR_PINC_Pos (9U)
#define DMA_SxCR_PINC_Msk (0x1UL << DMA_SxCR_PINC_Pos) /*!< 0x00000200 */
#define DMA_SxCR_PINC DMA_SxCR_PINC_Msk
#define DMA_SxCR_CIRC_Pos (8U)
#define DMA_SxCR_CIRC_Msk (0x1UL << DMA_SxCR_CIRC_Pos) /*!< 0x00000100 */
#define DMA_SxCR_CIRC DMA_SxCR_CIRC_Msk
#define DMA_SxCR_DIR_Pos (6U)
#define DMA_SxCR_DIR_Msk (0x3UL << DMA_SxCR_DIR_Pos) /*!< 0x000000C0 */
#define DMA_SxCR_DIR DMA_SxCR_DIR_Msk
#define DMA_SxCR_DIR_0 (0x1UL << DMA_SxCR_DIR_Pos) /*!< 0x00000040 */
#define DMA_SxCR_DIR_1 (0x2UL << DMA_SxCR_DIR_Pos) /*!< 0x00000080 */
#define DMA_SxCR_PFCTRL_Pos (5U)
#define DMA_SxCR_PFCTRL_Msk (0x1UL << DMA_SxCR_PFCTRL_Pos) /*!< 0x00000020 */
#define DMA_SxCR_PFCTRL DMA_SxCR_PFCTRL_Msk
#define DMA_SxCR_TCIE_Pos (4U)
#define DMA_SxCR_TCIE_Msk (0x1UL << DMA_SxCR_TCIE_Pos) /*!< 0x00000010 */
#define DMA_SxCR_TCIE DMA_SxCR_TCIE_Msk
#define DMA_SxCR_HTIE_Pos (3U)
#define DMA_SxCR_HTIE_Msk (0x1UL << DMA_SxCR_HTIE_Pos) /*!< 0x00000008 */
#define DMA_SxCR_HTIE DMA_SxCR_HTIE_Msk
#define DMA_SxCR_TEIE_Pos (2U)
#define DMA_SxCR_TEIE_Msk (0x1UL << DMA_SxCR_TEIE_Pos) /*!< 0x00000004 */
#define DMA_SxCR_TEIE DMA_SxCR_TEIE_Msk
#define DMA_SxCR_DMEIE_Pos (1U)
#define DMA_SxCR_DMEIE_Msk (0x1UL << DMA_SxCR_DMEIE_Pos) /*!< 0x00000002 */
#define DMA_SxCR_DMEIE DMA_SxCR_DMEIE_Msk
#define DMA_SxCR_EN_Pos (0U)
#define DMA_SxCR_EN_Msk (0x1UL << DMA_SxCR_EN_Pos) /*!< 0x00000001 */
#define DMA_SxCR_EN DMA_SxCR_EN_Msk

